/* cocoaControlController */

"applicationShouldTerminate:standardAlert" = "Q ne peut pas être fermé. Il y a toujours des PC émulés en fonctionnement.";
"applicationShouldTerminate:informativeText" = "Eteignez d'abord les PC émulés avant de quitter Q.";

"toolbar:label:newPC" = "Nouveau PC";
"toolbar:paletteLabel:newPC" = "Nouveau PC";
"toolbar:toolTip:newPC" = "Créer un nouveau PC";
"toolbar:label:editPC" = "Editer le PC";
"toolbar:paletteLabel:editPC" = "Editer le PC";
"toolbar:toolTip:editPC" = "Editer le PC";
"toolbar:label:removePC" = "Supprimer le PC";
"toolbar:paletteLabel:removePC" = "Supprimer le PC";
"toolbar:toolTip:removePC" = "Supprimer le PC";
"toolbar:label:startPC" = "Démarrer le PC";
"toolbar:paletteLabel:startPC" = "Démarrer le PC";
"toolbar:toolTip:startPC" = "Démarrer le PC";

"editPC:standardAlert" = "Le PC émulé \"%@\" ne peut pas être édité, car il est en fonctionnement ou dans un état sauvegardé.";
"editPC:informativeText" = "Eteignez d'abord le PC émulé \"%@\" avant de l'éditer.";

"deletePC:standardAlert" = "Le PC émulé \"%@\" ne peut pas être supprimé, car il est en fonctionnement.";
"deletePC:informativeText" = "Eteignez d'abord le PC émulé \"%@\" avant de le supprimer.";
"deletePC:alertWithMessageText" = "Suppression du PC";
"deletePC:defaultButton" = "OK";
"deletePC:alternateButton" = "Annuler";
"deletePC:informativeTextWithFormat" = "Etes-vous sûr de vouloir supprimer le PC émulé \"%@\"? Il sera supprimé définitivement de votre disque dur.";

"importVPC7PC:progress:title" = "Importation VPC7";
"importVPC7PC:progress:config" = "Traitement de la configuration VPC7";
"importVPC7PC:progress:hdx" = "Convertit Harddisk_%D.vhd";
"importVPC7PC:standardAlert:imageConvert" = "Conversion de l'image disque VPC7 échouée";
"importVPC7PC:informativeText:imageConvert" = "Ce type d'image disque VPC n'est pas supporté par Q.";
"importVPC7PC:standardAlert:plist" = "Importation du PC émulé VPC7 échouée";
"importVPC7PC:informativeText:plist" = "Ne peut pas lire Configuration.plist!\n";
"importVPC7PC:standardAlert:running" = "Importation du PC émulé VPC7 échoué";
"importVPC7PC:informativeText:running" = "Le PC est en fonctionnement! Il doit être éteint avant d'être converti.";
"importVPC7PC:standardAlert:finish" = "Importation du PC émulé VPC réussi";
"importVPC7PC:informativeText:finish" = "Merci de vérifier le PC émulé avant de le démarrer (Pour des disques manquants, etc.)";

"importQemuXPCs:progress:title" = "Importation QemuX";
"importQemuXPCs:progress:config" = "Traitement de la configuration QemuX";
"importQemuXPCs:progress:pc" = "Conversion du PC \"%@\"...";
"importQemuXPCs:progress:hdx" = "Copie du disque dur %@";
"importQemuXPCs:standardAlert:plist" = "Importation des PC émulés QemuX échouée";
"importQemuXPCs:informativeText:plist" = "Ne peut pas lire oslist.plist!";
"importQemuXPCs:standardAlert:finish" = "Importation des PC émulés QemuX réussie";
"importQemuXPCs:informativeText:finish" = "Merci de vérifier le PC émulé avant de le démarrer (Pour des disques manquants, etc.)";

"exportPCToFlashDrive:savePanel:title" = "Export";
"exportPCToFlashDrive:savePanel:prompt" = "Export";
"exportPCToFlashDrive:progressPanel:title" = "Status";
"exportPCToFlashDrive:progressPanel:text" = "Export";
"exportPCToFlashDrive:progressPanel:statusText1" = "Exporting..";
"exportPCToFlashDrive:progressPanel:statusText2" = "Copying binary..";
"exportPCToFlashDrive:progressPanel:statusText3" = "Copying Guest PC..";
"exportPCToFlashDrive:progressPanel:statusText4" = "Writing Guest PC configuration..";
"exportPCToFlashDrive:progressPanel:statusText5" = "Copying additional Guest PC disk images..";
"exportPCToFlashDrive:progressPanel:statusText6" = "Finishing Guest PC configuration..";
"exportPCToFlashDrive:alert:writeToFile:messageText" = "Error writing configuration";
"exportPCToFlashDrive:alert:writeToFile:informativeText" = "The configuration file could not be written.";
"exportPCToFlashDrive:alert:exportFinished:messageText" = "Export finished";
"exportPCToFlashDrive:alert:exportFinished:informativeText" = "Export of the Guest PC %@ is complete. You can now use it as a standalone application on any PowerPC or Intel Mac.";

"exportThisPCToFlashDrive:standardAlert" = "The Guest PC \"%@\" can not be exported to a Flash Drive, because it is in running or saved state.";
"exportThisPCToFlashDrive:informativeText" = "First shutdown the Guest PC \"%@\" then export it.";

"exportThisPCToFlashDrive:alertWithMessageText" = "Exporting the Guest PC \"%@\"";
"exportThisPCToFlashDrive:defaultButton" = "OK";
"exportThisPCToFlashDrive:alternateButton" = "Cancel";
"exportThisPCToFlashDrive:informativeTextWithFormat" = "The Guest PC will now be exported to run in standalone mode. This means you can take it with you on an external storage (for example on an USB Flash Drive), plug it into any Mac and run your Guest PC out of the box.\n\nPlease note that saving/loading a Guest PC state is not available in standalone mode. This does not affect your Guest PC configuration in Q.";

"importPCFromFlashDrive:alert:notFound:messageText" = "Could not find Guest PC";
"importPCFromFlashDrive:alert:notFound:informativeText" = "The file seems to be an ordinary application.";
"importPCFromFlashDrive:progressPanel:title" = "Status";
"importPCFromFlashDrive:progressPanel:text" = "Import";
"importPCFromFlashDrive:progressPanel:statusText1" = "Copying Guest PC..";
"importPCFromFlashDrive:alert:importFinished:messageText" = "Import finished";
"importPCFromFlashDrive:alert:importFinished:informativeText" = "Import of the Guest PC %@ is complete. You can now run it in Q.";

"addArgumentTo:standardAlert" = "Ne peut pas démarrer le PC émulé";
"addArgumentTo:informativeText" = "Cette configuration utilise une syntaxe pré-0.8.0 (%@). Merci de la supprimer depuis l'onglet avancé.";

"URLResourceDidFinishLoading:alertWithMessageText" = "Une nouvelle version de Q est disponible. Voulez-vous la télécharger maintenant?";
"URLResourceDidFinishLoading:defaultButton" = "OK";
"URLResourceDidFinishLoading:alternateButton" = "Annuler";

"tableView:audio" = "Audio: %@\n";
"tableView:mb" = "%@, %@mb\n";

"updateThisPC:standardAlert" ="The Guest PC \"%@\" can not be updated and compressed, because it is in running or saved state.";
"updateThisPC:informativeText" = "First shutdown the Guest PC \"%@\" then export it.";
"updateThisPC:alertWithMessageText" = "Update and compress Guest PC";
"updateThisPC:informativeTextWithFormat" = "All Disks of this Guest PC will be converted to qcow2 format and compressed. The disks will not be mountable on OS X. The qcow2 format ist the only format that supports the saving of a running Guest PC.";
"updateThisPC:defaultButton" = "Continue";
"updateThisPC:alternateButton" = "Cancel";
"updatePC:progress:title" = "Status";
"updatePC:progress:text" = "Convert and compress...";
"updatePC:progress:config" = "This process will take some minutes.";
"updatePC:standardAlert:imageConvert" = "Conversion of Diskimage failed";
"updatePC:informativeText:imageConvert" = "Please check the Diskimage";


/* vmstate */

"running" = "en fonctionnement";
"saved" = "sauvé";
"shutdown" = "éteint";


/* cocoaControlDiskImage */

"dIWindowCreate:file" = "Ma nouvelle imagedisque.%@";

"savePanelDidEnd:dIName" = "Image disque : %@";


/* cocoaControlEditPC */

"prepareEditPCPanel:newPC" = "Créer PC";
"prepareEditPCPanel:updatePC" = "Mettre à jour PC";

"toolbar:label:general" = "Général";
"toolbar:paletteLabel:general" = "Général";
"toolbar:toolTip:general" = "Général";
"toolbar:label:hardware" = "Matériel";
"toolbar:paletteLabel:hardware" = "Matériel";
"toolbar:toolTip:hardware" = "Matériel";
"toolbar:label:advanced" = "Avancé";
"toolbar:paletteLabel:advanced" = "Avancé";
"toolbar:toolTip:advanced" = "Avancé";
"toolbar:label:network" = "Réseau";
"toolbar:paletteLabel:network" = "Réseau";
"toolbar:toolTip:network" = "Réseau";

"viewGeneral:title" = "Q %@ - Général";

"viewHardware:title" = "Q %@ - Matériel";

"viewAdvanced:title" = "Q %@ - Avancé";

"viewNetwork:title" = "Q %@ - Réseau";

"setCustomDIType:title" = "Custom Image";

"editPCEditPCPanel:name" = "choisissesz un nom";
"editPCEditPCPanel:charName" = "Nom avec des caractères non-autorisés (:./)";
"editPCEditPCPanel:otherName" = "choisissez un autre nom";

"initFirewallSettings:popUpButtonFirewallAdittionalPortsCustom" = "Personnalisé..";

"startShowEditPort:restrictedPorts1" = "%@,%@ sur l'hôte vers port(s) %@,%@ sur le PC émulé (TCP and UDP).";
"startShowEditPort:restrictedPorts2" = "%@ sur l'hôte vers port(s) %@ sur le PC émulé (TCP).";
"startShowEditPort:restrictedPorts2" = "%@ sur l'hôte vers port(s) %@ sur le PC émulé (UDP).";
"startShowEditPort:AlertSheet:messageText" = "Ce service ne peut être édité!";
"startShowEditPort:AlertSheet:defaultButton" = "OK";
"startShowEditPort:AlertSheet:informativeText" = "%@ redirige les connexions entrantes depuis le(s) port(s) %@";

"startEditPort:popUpButtonFirewallAdittionalPortsCustom" = "Personnalisé..";

"deletePort:AlertSheet:messageText" = "Ce service ne peut être supprimé!";
"deletePort:AlertSheet:defaultButton" = "OK";
"deletePort:AlertSheet:informativeText" = "Pour empêcher ce service d'être rediriger, utiliser la case correspondante.";

"checkPort:textFieldFirewallPortError:name" = "Pas de nom vide!";
"checkPort:textFieldFirewallPortError:hostport" = "Pas d'entrée port-hôte vide!";
"checkPort:textFieldFirewallPortError:guestport" = "Pas d'entrée port-invité vide!";
"checkPort:textFieldFirewallPortError:illegalchars" = "Caractères non-autorisés dans les ports!";
"checkPort:textFieldFirewallPortError:combination" = "Combinaison de , et - non-autorisée.";


/* cocoaControlPreferences */

"toolbar:label:general" = "Général";
"toolbar:paletteLabel:general" = "Général";
"toolbar:toolTip:general" = "Général";

"viewGeneral:title" = "Général";

/* cocoaDownload */

"startBTDownload:torrentFile:length" = "N'a pas pu télécharger le fichier de données Bittorrent. Peut-être que le fichier n'existe plus ou que le serveur est injoignable.";
"startBTDownload:torrentFile:tError:invalid" = "Bittorrent: Torrent invalide/ mauvais fichier torrent.";
"startBTDownload:torrentFile:tError:unsupported" = "Bittorrent: Fichier torrent non-supporté.";
"startBTDownload:torrentFile:tError:exists" = "Bittorrent: Le torrent existe déjà.";
"startBTDownload:torrentFile:tError:miscellanious" = "Bittorrent: Erreur diverse.";

"checkDownloadStarted:errorDescription" = "Ne peut pas se connecter au serveur (Time-out).";

/* cocoaDownloadController */

"showAllDownloads:statusText" = "Loading List from Server..";
"showAllDownloads:statusText2" = "List loaded.";
"showAllDownloads:AlertSheet:standardAlert" = "Ne peut pas afficher les PC émulés depuis free.oszoo.org.";
"showAllDownloads:AlertSheet:defaultButton" = "OK";
"showAllDownloads:AlertSheet:informativeText" = "N'a pas pu obtenir la liste de PC émulés depuis kju-app.org.";

"tableView:objectValueForTableColumn:Size" = "Taille de téléchargement";
"tableView:objectValueForTableColumn:Author" = "fourni par";

"showDetails:MoreInfo" = "Plus d'infos";
"startDownload:downloadButton:Title" = "Arrêter";
"startDownload:statusText:Text" = "Démarrage du téléchargement...";

"stopDownload:AlertSheet:standardAlert" = "Vous avez des téléchargements en cours";
"stopDownload:AlertSheet:defaultButton" = "Arrêter";
"stopDownload:AlertSheet:alternativeButton" = "Annuler";
"stopDownload:AlertSheet:informativeText" = "Etes-vous sûr de vouloir arrêter le téléchargement?";

"downloadDidReceiveData:remainingString1" = "%d heures %d minutes restantes";
"downloadDidReceiveData:remainingString2" = "%d minutes %d secondes restantes";
"downloadDidReceiveData:remainingString3" = "environ %d minutes restantes";
"downloadDidReceiveData:remainingString4" = "environ %d secondes restantes";
"downloadDidReceiveData:connecting" = "Connexion..";
"downloadDidReceiveData:statusText1" = "%.0f %@ de %.1f %@ (%d ko/s), %@";
"downloadDidReceiveData:statusText2" = "%.1f %@ de %.1f %@ (%d ko/s), %@";

"downloadDidFinish:statusText" = "Téléchargement terminé.";
"downloadDidFail:statusText" = "Téléchargement échoué.";
"downloadDidFail:AlertSheet:standardAlert" = "Téléchargement échoué";
"downloadDidFail:AlertSheet:defaultButton" = "OK";

"uncompressPC:statusText" = "Extraction des fichiers..";

"finishDownload:statusText1" = "Importination OS libre..";
"finishDownload:message1" = "Vous pouvez maintenant utiliser votre OS libre.";
"finishDownload:message2" = "Le disque dur n'a pas pu être trouvé. Veuillez vérifier les paramètres avant d'utiliser votre OS libre.";
"finishDownload:message3" = "Les fichiers n'ont pas pu être extraits. L'archive semble corrompue. Vous pourriez essayer de l'extraire manuellement ou de signaler le problème à free.oszoo.org.\n\nChemin : %@";
"finishDownload:message4" = "Les fichiers n'ont pas pu être extraits. Le fichier téléchargé ne semble pas être une archive.\n\nChemin : %@";
"finishDownload:AlertSheet:messageText" = "Importation terminée";
"finishDownload:AlertSheet:defaultButton" = "OK";
"finishDownload:statusText2" = "Terminé.";
